БухЭксп/Catalogs/CW_РеестрыНДС0ЗаписиРеестра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_РеестрыНДС0ЗаписиРеестра</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанныеПриложения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПриложенияТабличныйДокумент</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДоходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяБаза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтверждениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0СтатусыЗаписиРеестра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеРеестра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучноеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приказ</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_РеестрыНДС0ЯчейкиПриложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеПриказа</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_РеестрыНДС0ЯчейкиПриложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_РеестрыНДС0Клиент/Ext/Module.bsl
Процедура СписокПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр) Экспорт
	
	Отказ = Истина;  
	
	СписокПриложений = CW_РеестрыНДС0СерверВызовСервера.ПолучитьСписокПриложений(Форма.ДокументРеализации);   
	Если СписокПриложений = Неопределено Тогда
		ПоказатьПредупреждение(,"Не удалось получить список приложений по грузоперевозкам!");
		Возврат;
	КонецЕсли;
	
	Если СписокПриложений.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Нет данных для формирования приложений Реестра по НДС 0%");
		Возврат;
	КонецЕсли;   

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", 				Форма);
	ДополнительныеПараметры.Вставить("ДокументРеализации",	Форма.ДокументРеализации);
	ДополнительныеПараметры.Вставить("ВедущийДокумент",	Неопределено);
	ДополнительныеПараметры.Вставить("ВедомыйДокумент",	Неопределено);
	
	Если ЗначениеЗаполнено(Форма.ДокументРеализации) Тогда
		СтруктураДокументов = CW_РеестрыНДС0СерверВызовСервера.ПолучитьВедомыйВедущийДокумент(Форма.ДокументРеализации);  
		
		ДополнительныеПараметры.Вставить("ВедущийДокумент",	СтруктураДокументов.ВедущийДокумент);
		ДополнительныеПараметры.Вставить("ВедомыйДокумент",	СтруктураДокументов.ВедомыйДокумент);
	КонецЕсли;
	
	ОписаниеОповещения = новый ОписаниеОповещения("ВыборЭлементаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Если СписокПриложений.Количество() = 1 Тогда
		ЭлементСписка = СписокПриложений.Получить(0);	
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, ЭлементСписка);
	Иначе
		СписокПриложений.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите приложения реестра по НДС 0%");     
	КонецЕсли;
	
КонецПроцедуры 

Процедура ВыборЭлементаЗавершение(ЭлементСписка, ДополнительныеПараметры) Экспорт
	
	Если ЭлементСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДокументов = Новый Структура;
	СтруктураДокументов.Вставить("ДокументРеализации", 	ДополнительныеПараметры.ДокументРеализации);
	СтруктураДокументов.Вставить("ВедущийДокумент", 	ДополнительныеПараметры.ВедущийДокумент);
	СтруктураДокументов.Вставить("ВедомыйДокумент", 	ДополнительныеПараметры.ВедомыйДокумент);
	СтруктураДокументов.Вставить("ПриложениеРеестра",	ЭлементСписка.Значение);
	
	СтруктураПарамтеров = CW_РеестрыНДС0СерверВызовСервера.ПолучитьСтруктуруПараметров(СтруктураДокументов);
	
	ОткрытьФорму("Справочник.CW_РеестрыНДС0ЗаписиРеестра.ФормаОбъекта", СтруктураПарамтеров, ДополнительныеПараметры.Форма);
	
КонецПроцедуры    




Процедура ПодготовитьДанныеЗаписиРеестраНДС(ПараметрКоманды, Источник) Экспорт  
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Источник", 		Источник);
	ДополнительныеПараметры.Вставить("ПараметрКоманды", ПараметрКоманды); 

	СписокРеестровНДС = CW_РеестрыНДС0СерверВызовСервера.ПодготовитьДанныеЗаписиРеестраНДСНаСервере(ПараметрКоманды);  
	Если СписокРеестровНДС.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Отсутствуют актуальные данные	реестров НДС 0%");
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СписокРеестров", 	СписокРеестровНДС);
	СтруктураПараметров.Вставить("ПараметрКоманды",	ПараметрКоманды);
	
	ОткрытьФорму("ОбщаяФорма.CW_РеестрыНДС0КонтрольЗаполнения", СтруктураПараметров, Источник, Новый УникальныйИдентификатор);  
	
КонецПроцедуры
